brew "antlr"
brew "awk"
brew "bash-completion"
brew "bash"
brew "black"
brew "coreutils"
brew "csvkit"
brew "dnsmasq"
brew "dos2unix"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fzf"
brew "ghostscript"
brew "git"
brew "go"
brew "gradle"
brew "graphviz"
brew "gron"
brew "httpd", restart_service: :changed
brew "jc"
brew "jq"
brew "jtbl"
brew "kotlin"
brew "llvm"
brew "lua"
brew "maven"
brew "mkcert"
brew "mypy"
brew "mysql", restart_service: :changed
brew "neovim"
brew "node"
brew "ocaml"
brew "openjdk"
brew "pandoc"
brew "pandoc"
brew "php"
brew "python-tk"
brew "python@3.13"
brew "rg"
brew "rsync"
brew "ruby"
brew "ruff"
brew "rust"
brew "rustup"
brew "the_silver_searcher"
brew "uv"
brew "weasyprint"
cask "dotnet-sdk"
cask "flutter"
cask "font-andale-mono"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-noto-sans-mono"
cask "font-roboto-mono"
cask "font-sf-mono"
cask "git-credential-manager"
cask "mactex"
cask "macvim"
cask "racket"
vscode "davidanson.vscode-markdownlint"
vscode "ecmel.vscode-html-css"
vscode "golang.go"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "rust-lang.rust-analyzer"
